//=========  start  创建光伏板的位置信息       ===========
var nbqNameListAndPosition=[
   //第一列
   {
		name:"逆变器1",
		x:-4300,
		z:1800
   },{
		name:"逆变器2",
		x:-4300,
		z:2200
   },
   {
		name:"逆变器3",
		x:-4300,
		z:2600
  },{
		name:"逆变器4",
		x:-4300,
		z:3000
   },{
		name:"逆变器5",
		x:-4300,
		z:3400
   },{
		name:"逆变器6",
		x:-4300,
		z:4000
   },{
		name:"逆变器7",
		x:-4300,
		z:4400
   },{
		name:"逆变器8",
		x:-4300,
		z:4800
   },{
		name:"逆变器9",
		x:-4300,
		z:5200
   },{
		name:"逆变器10",
		x:-4300,
		z:5600
   },{//第二列
		name:"逆变器11",
		x:-2000,
		z:1800
   },{
		name:"逆变器12",
		x:-2000,
		z:2200
   },
   {
		name:"逆变器13",
		x:-2000,
		z:2600
  },{
		name:"逆变器14",
		x:-2000,
		z:3000
   },{
		name:"逆变器15",
		x:-2000,
		z:3400
   },{
		name:"逆变器16",
		x:-2000,
		z:4000
   },{
		name:"逆变器17",
		x:-2000,
		z:4400
   },{
		name:"逆变器18",
		x:-2000,
		z:4800
   },{
		name:"逆变器19",
		x:-2000,
		z:5200
   },{
		name:"逆变器20",
		x:-2000,
		z:5600
   },{//第三列
		name:"逆变器21",
		x:300,
		z:1800
   },{
		name:"逆变器22",
		x:300,
		z:2200
   },
   {
		name:"逆变器23",
		x:300,
		z:2600
  },{
		name:"逆变器24",
		x:300,
		z:3000
   },{
		name:"逆变器25",
		x:300,
		z:3400
   },{
		name:"逆变器26",
		x:300,
		z:4000
   },{
		name:"逆变器27",
		x:300,
		z:4400
   },{
		name:"逆变器28",
		x:300,
		z:4800
   },{
		name:"逆变器29",
		x:300,
		z:5200
   },{
		name:"逆变器30",
		x:300,
		z:5600
   },{//第四列
		name:"逆变器31",
		x:2600,
		z:1800
   },{
		name:"逆变器32",
		x:2600,
		z:2200
   },
   {
		name:"逆变器33",
		x:2600,
		z:2600
  },{
		name:"逆变器34",
		x:2600,
		z:3000
   },{
		name:"逆变器35",
		x:2600,
		z:3400
   },{
		name:"逆变器36",
		x:2600,
		z:4000
   },{
		name:"逆变器37",
		x:2600,
		z:4400
   },{
		name:"逆变器38",
		x:2600,
		z:4800
   },{
		name:"逆变器39",
		x:2600,
		z:5200
   },{
		name:"逆变器40",
		x:2600,
		z:5600
   }
];
//=========   end   创建光伏板的位置信息       ===========

//=========   start 逆变器信号点的名称的值得集合  注意0-13的位置不能变  （"方向角控制"）lastIndex的位置不能变 其他的在"PV4输入电流"与"方向角控制"之间添加 ======
var signalForNBQColNames = ["PV1输入电压","PV1输入电流","PV2输入电压","PV2输入电流","PV3输入电压","PV3输入电流","PV4输入电压","PV4输入电流",
                            "电网A相电压【UA】","电网B相电压【UB】","电网C相电压【UC】","电网A相电流【IA】","电网B相电流【IB】","电网C相电流【IC】",
                            "逆变器效率","机内温度","输入总功率","逆变器开机时间","逆变器关机时间","电网频率","功率因数",
                            //异常正常信号点  这里取得是逆变器的状态(有问题，先就不做修改了)
                            "逆变器状态",
                            "方向角控制"];
//=========   end   逆变器信号点的名称的值得集合  ======

//箱变设备
var xbInfos =[{
	name:"箱变",
	x:-2550,
	y:0,
	z:3600
},{
	name:"箱变2",
	x:2050,
	y:0,
	z:3600
}];
//箱变的信号点
var signalForXBColNames = ["进线Ia","进线Ib","进线Ic","母线Ua","母线Ub","母线Uc","进线总有功","进线总无功",
                           
                           //下面是开关的遥信信号  分别是1011、1012、1013
                           "低压侧开关合位","低压侧开关分位","高压开关合位"];


//地板的长宽高和位置
var floorInfos ={
		width:10000,
		height:5,
		depth:6000,
		x:-200,
		y:-103,
		z:3500,
};

//无人机器人
var wrjInfos = [{
	name:"无人机器人1",
	x : -4600,
	y : 0,
	z : 1300
}]

/**
 * 无人机的航行路线
 */
var wrjPath =[{
	x:-4600,
	y:0,
	z:1300
},{//向上移动
	x:-4000,
	y:1000,
	z:1300
},{
	x:-4000,
	y:1000,
	z:5200
},{
	x:-3200,
	y:1000,
	z:5200
},{
	x:-3200,
	y:1000,
	z:2600
},{
	x:0,
	y:1000,
	z:2600
},{
	x:0,
	y:1000,
	z:5200
},{
	x:3600,
	y:1000,
	z:5200
},{
	x:3600,
	y:1000,
	z:2000
},{
	x:-3600,
	y:1000,
	z:2000
},{
	x:-3600,
	y:1000,
	z:2000
},{
	x:-4300,
	y:1000,
	z:2000
},{
	x:-4600,
	y:1000,
	z:1800
},{
	x:-4600,
	y:1000,
	z:1300
},{
	x:-4600,
	y:0,
	z:1300
}]

var countFor3DGlob = 3;//3d的支架个数
//增益的导数
var gainDerivativeGlob = 0.01;//增益倒数，当设置的时候因为有增益导致设置的   值乘于了增益，这里需要将这个设置的于手动输入的值一致，所以这里需要设置一个增益的导数，比如如果增益设置的是100，则这个值就是0.01

var zhuZhiHieght = 95;